package com.media;

/**
 * +----------------------------------------------------------------------
 * |  说明     ：
 * +----------------------------------------------------------------------
 * | 创建者   :  ldw
 * +----------------------------------------------------------------------
 * | 时　　间 ：2018/5/3 15:11
 * +----------------------------------------------------------------------
 * | 版权所有: 北京市车位管家科技有限公司
 * +----------------------------------------------------------------------
 **/
public class MediaConverter {

    /**
     * 把YUV420SP转化成RGB565
     * @param yuv YUV420SP媒体数据
     * @param rgb RGB565媒体数据
     * @param width 转化后的RGB565数据的宽度
     * @param height 转化后的RGB565数据的宽度
     * @return 转化结果，1：成功；0：失败
     */
    public native int YUV420SP2RGB565(byte[] yuv, byte[] rgb, int width, int height);


    static {
        System.loadLibrary("MediaConverter");
    }
}
